1 Def Plt 1,P1,P2,P3,P4,6,4,1
2 M1=1                                              'M1(计数器 )初始化
3 *LOOP
4 Mov PICK, 30                                    '往取出工件位置上空 50mm移动
5 Ovrd 30
6 Mvs PICK
7 'HClose 1                                          '抓手闭
8 Dly 0.5                                           '抓手闭后等待0.5秒
9 Ovrd 50
10 Mvs,30                                           '往现在位置上空 50mm移动
11 PLACE = Plt 1, M1                                '计算第M1号的位置
12 Mov PLACE, 30                                   '往Pallt上放置位置上空50mm移动
13 Ovrd 50
14 Mvs PLACE
15 'HOpen 1                                          '抓手开
16 Dly 0.5
17 Ovrd 50
18 Mvs,30                                           '往现在位置上空 50mm移动
19 M1=M1+1                                      '计数器加算
20 If M1 <=24 Then *LOOP                 '计数在范围内的话，从 *LOOP开始反复
21 Mov PICK,30
22 Hlt
23 End
P1=(+432.321,-238.464,+88.396,+0.000,+0.000,+181.913)(4,0)
P2=(+212.110,-239.726,+88.271,+0.000,+0.000,+194.140)(4,0)
P3=(+434.059,-371.130,+85.790,+0.000,+0.000,+132.760)(4,0)
P4=(+212.155,-372.195,+84.742,+0.000,+0.000,-211.369)(4,0)
PICK=(+412.252,-69.179,+83.249,+0.000,+0.000,-143.021)(4,0)
PLACE=(+434.059,-371.130,+85.790,+0.000,+0.000,+132.760)(4,0)
