1 Close
2 Open "COM2:" As #1
3 Wait M_Open(1)=1
4 Input #1, MCNT
5 M_00#=MCNT
6 '=======
7 'Select MCNT
8 'Case  10             ' ＭＣＮＴ ＝１０
9 'Hlt
10 'Break
11 'Case  14             ' ＭＣＮＴ ＝１4
12 '
13 'Break
14 'Case  15            ' ＭＣＮＴ ＝１5
15 '
16 '
17 'Break
18 'Default                ' 上记以外
19 'M_Out(10)=1
20 'Break
21 'End Select
P1=(+322.616,-256.218,+100.000,+0.000,+0.000,+0.000)(4,0)
P2=(+322.616,+302.521,+100.000,+0.000,+0.000,+0.000)(4,0)
P4=(+564.198,-12.868,+100.000,+0.000,+0.000,+0.000)(4,0)
