1 'M_01模式选择 (100进入工具坐标标定模式, 200进入自动模式, 300进入手动模式, 400进入视觉坐标标定模式，500进入当前位置标定模式,1000PH标定模式)
2 'M_02模式参数1
3 'M_03模式参数2
4 'M_04模式参数3
5 'M_05模式占用标志
6 '====================================================================
7 '初始化参数
8 M500=0
9 M_01# = 0
10 M_02# = 0
11 M_03# = 0
12 M_04# = 0
13 M_05# = 0
14 M102=10
15 'If M_Psa(2)=0 Then GoTo *LblRun
16 '*Lbl1
17 'XLoad 2,"SELECTTHREAD"
18 '*L30:If C_Prg(2)<>"SELECTTHREAD" Then GoTo *L30
19 'XRun 2
20 'Wait M_Run(2)=1
21 'Dly 1
22 '*LblRun
23 'If M_Run(2)=0 Then XRun 2
24 'Wait M_Run(2)=1
25 *LSTR
26 Select M_01#
27 '====================================================================
28 '自动模式
29 '==================================
30 Case 200
31 M_05#=1
32 Dly 0.1
33 Tool TooL0
34 Close
35 Open "COM3:" As #1            '打开通讯端口COM1、文件1
36 Spd 800
37 Ovrd 40
38 Dly 0.2
39 Loadset 1,1
40 OAdl On
41 Servo On
42 Wait M_Svo=1
43 M_Out(16)=0
44 PCU=P_Fbc
45 PCU.Z=90
46 Mvs PCU
47 Mvs Psafety
48 *loop1
49 m101=0
50 *loopDown
51 Mov PICK,50
52 Mvs PICK
53 Dly 0.2
54 M_Out(16)=1
55 Dly 0.5
56 Mvs PICK,50
57 Wait M_Open(1)=1            '等待COM3打开才执行下一步
58 *loopP
59 m100=0                            'm100=1时，报警换盖板
60 If m101=1 Then GoTo *lSkipUp
61 Wait M_Open(1) = 1              '等待COM1打开才执行下一步
62 Print# 1, "TRGP",M102                 '发送TRG，让H上面相机拍照
63 Dly 0.1
64 Input #1,mxup,myup,maup     '接收来至相机的数据
65 If mxup=0 Then
66 Mvs Psafety
67 m100=1
68 Hlt
69 GoTo *loopP
70 EndIf
71 m100=0
72 pvs1=P_Zero                          '把pvs清零
73 pvs1=PVSCal(2,mxup,myup,maup)      '把
74 pvs1.C=-maup                    '将角度单位度(deg)转换为弧度(rad)。写进pvs.C
75 pvs1.FL1=pvschk.FL1
76 pvs1.FL2=pvschk.FL2
77 pplace1=pvs1*phup
78 *lSkipUp
79 Mov pvschk
80 Dly 0.5
81 Wait M_Open(1)=1
82 Print# 1, "TRGS",M102
83 Dly 0.1
84 Input #1,mx,my,ma
85 If mx=0 Then
86 Mvs Psafety
87 M_Out(16)=0
88 Dly 0.2
89 m101=1
90 GoTo *loopDown
91 EndIf
92 m101=0
93 pvs=P_Zero
94 pvs=PVSCal(1,mx,my,ma)
95 pvs.C=ma
96 pvs.FL1=pvschk.FL1
97 pvs.FL2=pvschk.FL2
98 phnd=pvs*ph
99 phosei=Inv(phnd)*pvschk
100 pplace2=pplace1*phosei
101 Spd 600
102 Mvs pplace2,60
103 Mvs pplace2
104 Dly 0.2
105 M_Out(16)=0
106 Dly 0.2
107 Spd 800
108 Mvs pplace2,50
109 Dly 0.2
110 Mov Psafety
111 GoTo *loop1
112 M_05#=0
113 M_01#=0
114 Break
115 '====================================================================
116 '手动模式
117 '==================================
118 ''X点动
119 Case 300
120 Tool TooL0
121 M_01# = 0
122 If (M_02# > 0) And (M_02# <= 100) Then Spd M_02#
123 If M_02# <= 0 Then Spd 10
124 If M_02# > 100 Then Spd 10
125 P20 = P_Fbc
126 If (M_03# >= -50) And (M_03# <= 50) Then P20.X = P20.X + M_03#
127 Mvs P20
128 Break
129 '==================================
130 ''Y点动
131 Case 301
132 Tool TooL0
133 M_01# = 0
134 If (M_02# > 0) And (M_02# <= 100) Then Spd M_02#
135 If M_02# <= 0 Then Spd 10
136 If M_02# > 100 Then Spd 10
137 P20 = P_Fbc
138 If (M_03# >= -50) And (M_03# <= 50) Then P20.Y = P20.Y + M_03#
139 Mvs P20
140 Break
141 '==================================
142 'Z
143 Case 302
144 Tool TooL0
145 M_01# = 0
146 If (M_02# > 0) And (M_02# <= 100) Then Spd M_02#
147 If M_02# <= 0 Then Spd 10
148 If M_02# > 100 Then Spd 10
149 P20 = P_Fbc
150 If (M_03# >= -50) And (M_03# <= 50) Then P20.Z = P20.Z + M_03#
151 Mvs P20
152 Break
153 '==================================
154 'C
155 Case 303
156 Tool TooL0
157 M_01# = 0
158 If (M_02# > 0) And (M_02# <= 100) Then Spd M_02#
159 If M_02# <= 0 Then Spd 10
160 If M_02# > 100 Then Spd 10
161 P20 = P_Fbc
162 If (M_03# >= -50) And (M_03# <= 50) Then P20.C = P20.C + M_03#
163 Mvs P20
164 Break
165 '==================================
166 ''拍照位
167 Case 306
168 M_01#=0
169 Tool TooL0
170 If (M_02#>0) And (M_02#<=100) Then Spd M_02#
171 If M_02#<=0 Then Spd 10
172 If M_02#>100 Then Spd 10
173 P20=P_Fbc
174 P20.Z=90
175 Mvs P20
176 Mvs Psafety                'Psafety 安全位
177 Mvs pvschk,20
178 Mvs pvschk               'PVSCHK拍照位
179 Break
180 '==================================
181 ''取料位
182 Case 307
183 M_01#=0
184 Tool TooL0
185 If (M_02#>0) And (M_02#<=100) Then Spd M_02#
186 If M_02#<=0 Then Spd 10
187 If M_02#>100 Then Spd 10
188 P20=P_Fbc
189 P20.Z=90
190 Mvs P20
191 Mvs Psafety                'Psafety 安全位
192 Mvs PICK ,20
193 Mvs PICK                     'PICK 上料位
194 Break
195 '==================================
196 ''放料位
197 Case 308
198 M_01#=0
199 Tool TooL0
200 If (M_02#>0) And (M_02#<100) Then Spd M_02#
201 If M_02#<=0 Then Spd 10
202 If M_02#>100 Then Spd 10
203 P20=P_Fbc
204 P20.Z=90
205 Mvs P20
206 Mvs Psafety                'Psafety 安全位
207 Mvs put,20
208 Mvs put                      'PUT放料位
209 Break
210 '==================================
211 ''安全位
212 Case 309
213 M_01#=0
214 Tool TooL0
215 If (M_02#>0) And (M_02#<100) Then Spd M_02#
216 If M_02#<=0 Then Spd 10
217 If M_02#>100 Then Spd 10
218 P20=P_Fbc
219 P20.Z=90
220 Mvs P20
221 Mvs Psafety                'Psafety 安全位
222 Break
223 '==================================================================
224 '读取当前位置并保存
225 '==================================
226 '标定取料位
227 Case 500
228 Tool TooL0
229 M_01#=0
230 PICK=P_Fbc
231 Dly 0.2
232 Break
233 '==================================
234 '标定拍照位
235 Case 501
236 Tool TooL0
237 M_01#=0
238 pvschk=P_Fbc
239 Dly 0.2
240 Break
241 '==================================
242 '标定放料位
243 Case 502
244 Tool TooL0
245 M_01#=0
246 put=P_Fbc
247 Dly 0.2
248 Break
249 '==================================
250  '标定安全位
251 Case 503
252 Tool TooL0
253 M_01#=0
254 Psafety=P_Fbc
255 Dly 0.2
256 Break
257 '====================================================================
258  '吸IO ON
259 Case 504
260 M_Out(16) = 1
261 Break
262 '====================================================================
263  '吸IO OfF
264 Case 505
265 M_Out(16) = 0
266 Break
267 '====================================================================
268  'IO2 ON
269 Case 506
270 M_Out(15) = 1
271 Break
272 '====================================================================
273  ''IO2 OfF
274 Case 507
275 M_Out(15) = 0
276 Break
277 '====================================================================
278 '==================================
279 '标定上CCD坐标标定的三个点位
280 Case 511
281 Tool P_10
282 M_01#=0
283 PT21=P_Fbc
284 Dly 0.2
285 Break
286 Case 512
287 Tool P_10
288 M_01#=0
289 PT22=P_Fbc
290 Dly 0.2
291 Break
292 Case 513
293 Tool P_10
294 M_01#=0
295 PT23=P_Fbc
296 Dly 0.2
297 Break
298 '==================================
299 '标定下CCD坐标标定的三个点位
300 Case 521
301 Tool P_11
302 M_01#=0
303 PT31=P_Fbc
304 Dly 0.2
305 Break
306 Case 522
307 Tool P_11
308 M_01#=0
309 PT32=P_Fbc
310 Dly 0.2
311 Break
312 Case 523
313 Tool P_11
314 M_01#=0
315 PT33=P_Fbc
316 Dly 0.2
317 Break
318 '工具坐标标定模式
319 '==================================
320 '盖板TOOL      上CCD
321 Case 100
322 Tool TooL0
323 M_01#=0
324 Servo On
325 Wait M_Svo=1
326 P20=P_Fbc
327 P20.Z=120
328 Mvs P20
329 P20.C=PT1.C
330 Mov P20
331 Mov PT1, 40
332 Mvs PT1                'PT1 安全位
333 'Tool P_NTool
334 Break
335 '作业１
336 'Hlt
337 Case 110
338 Tool TooL0
339 M_01#=0                   '手编移动机器人到像素中心     之后强制8信号输入
340 P100 = PT1
341 PT1 = P_Fbc
342 'P100 = P_Fbc
343 PT4.C=P100.C+Rad(90)
344 PT4.Z=PT1.Z
345 'P101 = P100 * (+0.000,+0.000,+0.000,+0.000,+0.000,+90.000)
346 Mvs PT1, 40
347 Mov PT4, 40
348 Mvs PT4
349 Break  '旋'Hlt                       '手编再次移动机器人到像素中心
350 '作业２ 直角坐标下移动X,Y轴到十字标定点
351 Case 111
352 Tool TooL0
353 M_01#=0
354 P102 = P_Fbc
355 PT4=P_Fbc
356 PTL = P_Zero
357 PT = Inv(P102)*P100
358 PTL.X = (PT.X+PT.Y)/2
359 PTL.Y = (-PT.X+PT.Y)/2
360 PTL.C=PT.C
361 P_10 = PTL
362 PT10=P_Fbc
363 Tool P_10
364 Break
365 '==================================
366 '过渡片TOOL      下CCD
367 Case 120
368 Tool TooL0
369 M_01#=0
370 Servo On
371 Wait M_Svo=1
372 P20=P_Fbc
373 P20.Z=120
374 Mvs P20
375 P20.C=PT2.C
376 Mov P20
377 Mvs PT2                'PT2 安全位
378 'Tool P_NTool
379 'M500=0
380 Break
381 '作业１
382 Case 121            'Hlt                    '手编移动机器人到像素中心     之后强制8信号输入
383 Tool TooL0
384 M_01#=0
385 P100 = PT2
386 PT2 = P_Fbc
387 PT3.C=P100.C+Rad(90)
388 PT3.Z=PT2.Z
389 'P101 = P100 * (+0.000,+0.000,+0.000,+0.000,+0.000,+90.000)
390 Mvs PT3                                                      '旋转90度
391 'M500=M500+1
392 Break                     '手编再次移动机器人到像素中心
393 Case 122                          '作业２ 直角坐标下移动X,Y轴到十字标定点
394 Tool TooL0
395 M_01#=0
396 P102 = P_Fbc
397 PT3=P_Fbc
398 PTL = P_Zero
399 PT = Inv(P102)*P100
400 PTL.X = (PT.X+PT.Y)/2
401 PTL.Y = (-PT.X+PT.Y)/2
402 P_11 = PTL
403 P_11.C=-PT3.C
404 PT20=P_Fbc
405 Tool P_11
406 'M500=M500+1
407 Break
408 '视觉坐标标定模式
409 '==================================
410 '盖板      上CCD
411 Case 400
412 ''像素标定
413 ''相机像素点转换为机器人坐标 走N个点  记录机器人位置   与像素点对应写入标定
414 M_05#=1
415 Servo On
416 Wait M_Svo=1
417 Tool P_10
418 P1=P_Fbc
419 P1.Z=100
420 Mvs P1
421 Mvs Psafety
422 Mvs PT21,50
423 Def Plt 1,PT21,PT22,PT23, ,3,3,1
424 Spd 100
425 M11=1                      'M1(计数器 )初始化
426 *LOOP10
427 PhotoPlace = Plt 1, M11      '计算第M1号的位置
428 Mvs PhotoPlace
429 Dly 0.2
430 Close
431 Open "COM3:" As #1
432 Dly 0.2
433 Print #1,"TRGP"
434 Input #1,M4,m5
435 M1=PhotoPlace.X
436 M2=PhotoPlace.Y
437 M3=0
438 Dly 0.2
439 Print #1,"XY",M1,M2
440 Input #1,M3
441 Wait M3=1               '读取机器人1号位置坐标，CCD像素坐标
442 M11=M11+1               '计数器加算
443 Close
444 If M11 <=9 Then *LOOP10    '计数在范围内的话，从 *LOOP开始反复
445 M_01#=0
446 M_05#=0
447 Break
448 '==================================
449 '过渡片      下CCD
450 Case 401
451 ''像素标定
452 ''相机像素点转换为机器人坐标 走N个点  记录机器人位置   与像素点对应写入标定
453 M_05#=1
454 Servo On
455 Wait M_Svo=1
456 Tool P_11
457 P1=P_Fbc
458 P1.Z=100
459 Mvs P1
460 Mvs Psafety
461 Def Plt 1,PT31,PT32,PT33, ,3,3,1
462 Spd 100
463 M11=1                      'M1(计数器 )初始化
464 *LOOP11
465 PhotoPlace = Plt 1, M11      '计算第M1号的位置
466 Mvs PhotoPlace
467 Dly 0.2
468 Close
469 Open "COM3:" As #1
470 Dly 0.2
471 Print #1,"TRGS"
472 Input #1,M4,m5
473 M1=PhotoPlace.X
474 M2=PhotoPlace.Y
475 M3=0
476 Dly 0.2
477 Print #1,"XY",M1,M2
478 Input #1,M3
479 Wait M3=1               '读取机器人1号位置坐标，CCD像素坐标
480 M11=M11+1               '计数器加算
481 Close
482 If M11 <=9 Then *LOOP11    '计数在范围内的话，从 *LOOP开始反复
483 M_01#=0
484 M_05#=0
485 Break
486 '===================================================================
487 '计算PH值
488 '==================================
489 '上CCD
490 Case 1000
491 M_05#=1
492 Tool TooL0
493 OAdl On                   '打开最佳加减速控制
494 Spd 500                    '速度指定100。单位：［mm/s］
495 P1=P_Fbc
496 P1.Z=90
497 Mvs P1
498 Mvs Psafety
499 Close
500 Open "COM3:" As #1            '打开通讯端口COM1、文件1
501 Wait M_Open(1) = 1              '等待COM1打开才执行下一步
502 Print# 1, "TRGP"                   '发送TRG，让相机拍照
503 Dly 0.1
504 Input #1, mx2, my2, mc2       '接收来至相机的数据mx,my,ma
505 pvs2 = P_Zero                       '将pvs0返回到(0,0,0,0,0,0,0,0)(0,0)。
506 pvs2 = PVSCal(2, mx2, my2, mc2)  '将视觉传感器输出的像素数据转换成机器人的坐标数据
507 pvs2.C = -mc2                  '将ma角度单位度(deg)转换为弧度(rad)。写进pvs0.C
508 pvs2.FL1 = put.FL1            '将pvschk.FL1 赋值给pvs0.FL1
509 pvs2.FL2 = put.FL2            '将pvschk.FL2 赋值给pvs0.FL2
510 phup = Inv(pvs2) * put        '计算从视觉传感器输出位置到抓取位置的修正值PH
511 Hlt
512 Mvs put, 50
513 Mvs put
514 Dly 0.2
515 M_Out(16) = 1
516 Dly 0.2
517 Mvs put, 50
518 Mvs Psafety
519 Dly 0.2
520 Mov pvschk              '拍照位PVSCHK
521 '下CCD=====================================
522 'Close
523 'Open "COM3:" As #1           '打开通讯端口COM3、文件2
524 'Wait M_Open(1) = 1            '等待COM3打开才执行下一步
525 Print #1, "TRGS"                 '发送TRG，让相机拍照
526 Dly 0.1
527 Input #1, mx1, my1, mc1        '接收来至相机的数据mx,my,ma
528 pvs1 = P_Zero                    '将pvs0返回到(0,0,0,0,0,0,0,0)(0,0)。
529 pvs1 = PVSCal(1, mx1, my1, mc1)  '将视觉传感器输出的像素数据转换成机器人的坐标数据
530 pvs1.C = mc1                '将ma角度单位度(deg)转换为弧度(rad)。写进pvs0.C
531 pvs1.FL1 = pvschk.FL1             '将pvschk.FL1 赋值给pvs0.FL1
532 pvs1.FL2 = pvschk.FL2             '将pvschk.FL2 赋值给pvs0.FL2
533 ph = Inv(pvs1)*pvschk          '计算从视觉传感器输出位置到抓取位置的修正值PH
534 Mov PICK, 50
535 Mvs PICK, 3
536 P1=PVSCal(1, 1000, 1000, 0)
537 p2=PVSCal(1, 1001, 1000, 0)
538 M1dx=p2.X-P1.X
539 M1dy=p2.Y-P1.Y
540 P1=PVSCal(2, 1000, 1000, 0)
541 p2=PVSCal(2, 1001, 1000, 0)
542 M2dx=p2.X-P1.X
543 M2dy=p2.Y-P1.Y
544 Print #1,"PIX",M1dx,M1dy,M2dx,M2dy
545 Dly 0.2
546 Close
547 Dly 0.2
548 M_01#=0
549 M_05#=0
550 Break
551 '====================================================================
552 End Select
553 GoTo  *LSTR
554 End
PCU=(-122.051,-287.862,+90.000,+0.000,+0.000,+149.666)(0,0)
Psafety=(+376.670,+11.262,+117.515,+0.000,+0.000,+136.261)(0,0)
PICK=(-122.051,-287.862,+50.366,+0.000,+0.000,+149.666)(0,0)
pvs1=(+381.316,-133.782,+0.000,+0.000,+0.000,+3.266)(0,0)
pvschk=(+219.162,+40.028,+109.962,+0.000,+0.000,+136.256)(0,0)
pplace1=(+382.746,-135.724,+55.672,+0.000,+0.000,+137.303)(0,0)
phup=(+1.317,-2.020,+55.672,+0.000,+0.000,+134.037)(0,0)
pvs=(+219.155,+42.743,+0.000,+0.000,+0.000,-7.162)(0,0)
phnd=(+188.053,+35.562,+109.962,+0.000,+0.000,+122.677)(0,0)
ph=(-29.964,-11.003,+109.962,+0.000,+0.000,+129.839)(0,0)
phosei=(-13.036,-28.596,+0.000,+0.000,+0.000,+13.579)(0,0)
pplace2=(+411.719,-123.548,+55.672,+0.000,+0.000,+150.882)(0,0)
P20=(+179.216,+130.926,+120.000,+0.000,+0.000,+140.508)(0,0)
put=(+383.298,-135.802,+55.672,+0.000,+0.000,+137.475)(0,0)
PT21=(+402.731,-163.484,+55.493,+0.000,+0.000,+140.507)(0,0)
PT22=(+354.721,-158.486,+55.492,+0.000,+0.000,+140.503)(0,0)
PT23=(+407.511,-129.489,+55.492,+0.000,+0.000,+140.500)(0,0)
PT31=(+239.889,+50.241,+110.081,+0.000,+0.000,-0.005)(0,0)
PT32=(+206.566,+57.122,+110.080,+0.000,+0.000,-0.012)(0,0)
PT33=(+234.579,+27.235,+110.080,+0.000,+0.000,-0.008)(0,0)
PT1=(+348.336,-49.637,+55.495,+0.000,+0.000,+140.508)(0,0)
P100=(+348.336,-49.637,+55.495,+0.000,+0.000,+140.508,+0.000,+0.000)(0,0)
PT4=(+286.990,-176.077,+55.495,+0.000,+0.000,+230.508)(0,0)
P102=(+286.990,-176.077,+55.495,+0.000,+0.000,+230.508,+0.000,+0.000)(0,0)
PTL=(-84.830,+51.760,+0.000,+0.000,+0.000,-90.000,+0.000,+0.000)(0,0)
PT=(-136.590,-33.070,+0.000,+0.000,+0.000,-90.000,+0.000,+0.000)(0,0)
PT10=(+286.990,-176.077,+55.495,+0.000,+0.000,+230.508,+0.000,+0.000)(0,0)
PT2=(+317.733,+63.690,+110.083,+0.000,+0.000,+44.187)(0,0)
PT3=(+198.864,+138.429,+110.083,+0.000,+0.000,+134.187)(0,0)
PT20=(+198.864,+138.429,+110.083,+0.000,+0.000,+134.187,+0.000,+0.000)(0,0)
P1=(+380.883,-143.530,+100.000,+0.000,+0.000,+140.508)(0,0)
PhotoPlace=(+359.501,-124.491,+55.491,+0.000,+0.000,+140.496)(0,0)
pvs2=(+381.862,-133.865,+0.000,+0.000,+0.000,+3.438)(0,0)
p2=(+389.143,-144.321,+0.000,+0.000,+0.000,+172.850,+0.000,+0.000)(0,0)
P_safety=(0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000)(,)
