1 'M_01模式选择 (100进入工具坐标标定模式, 200进入自动模式, 300进入手动模式, 400进入视觉坐标标定模式)
2 'M_02功能选择
3 'M_03手动模式下移动速度
4 'M_04点动移动的距离
5 'M_05防止模式选择冲突
6 '====================================================================
7 '初始化参数
8 M_01#=0
9 M_02#=0
10 M_03#=0
11 M_04#=0
12 M_05#=0
13 '====================================================================
14 '定义模式和线程
15 *LSTR
16 M_01#=0
17 M_02#=0
18 M_03#=0
19 M_04#=0
20 M_05#=0
21 Def Act 1,  M_01# = 500  GoSub*LSERVO
22 Def Act 5,  M_01# = 100  GoSub*LTOOL            '工具坐标标定模式      'M_02=100~199
23 Def Act 2,  M_01# = 200 GoSub*LAUTO             '自动模式                   'M_02=200~299
24 Def Act 3,  M_01# = 300 GoSub*LMANUAL         '手动模式'                  'M_02=300~399
25 Def Act 4,  M_01# = 400 GoSub*LVISUAL           '视觉坐标标定模式'     'M_02=400~499
26 'Def Act 5, M_01# = 500 GoSub*LSPEED            '手动速度设置'            M_02=500~599
27 Act 1=1
28 Act 2=1
29 Act 3=1
30 Act 4=1
31 Act 5=1
32 If M_Psa(2)=0 Then *LblRun
33 *Lbl1
34 XLoad 2,"THREAD"
35 *L30:If C_Prg(2)<>"THREAD" Then GoTo *L30
36 XRun 2
37 Wait M_Run(2)=1
38 Dly 1
39 *LblRun
40 If M_Run(2)=0 Then XRun 2
41 Wait M_Run(2)=1
42 Act 1=0
43 Act 2=0
44 Act 3=0
45 Act 4=0
46 Act 5=0
47 GoTo *LSTR
48 End
49 '====================================================================
50 '伺服切换开关模式 'M_02=100~199
51 *LSERVO:  ''
52 MFEATURES = M_02#
53 Select MFEATURES
54 M_05#=1
55 '==================================
56 '伺服 ON
57 Case 500
58 Servo On
59 Break
60 '==================================
61 '伺服 OFF
62 Case 501
63 Servo Off
64 Break
65 '==================================
66 '程序暂停
67 Case 502
68 Act 3=0
69 Wait M_In(16)=1
70 Break
71 End Select
72 M_01#=0
73 M_02#=0
74 M_05#=0
75 Return 0
76 ''====================================================================
77 '工具坐标标定模式 'M_02=100~199
78 *LTOOL:  ''
79 MFEATURES = M_02#
80 Select MFEATURES
81 M_05#=1
82 '==================================
83 '上CCD TOOL
84 Case 100
85 Servo On
86 Wait M_Svo=1
87 Tool P_NTool
88  '作业１
89 Wait M_In(18)=1                     '手编移动机器人到像素中心     之后强制8信号输入
90 P0=P_Fbc
91 P91=P0*(+0.000,+0.000,+0.000,+0.000,+0.000,+90.000)
92 Mvs P91                                                         '旋转90度
93 Wait M_In(16)=1  'Hlt                       '手编再次移动机器人到像素中心
94 '作业２ 直角坐标下移动X,Y轴到十字标定点
95 P90=P_Fbc
96 PTL=P_Zero
97 PT=Inv(P90)*P0
98 PTL.X=(PT.X+PT.Y)/2
99 PTL.Y=(-PT.X+PT.Y)/2
100 P_01=PTL
101 Tool P_01
102 Break
103 '==================================
104 '下CCD TOOL
105 Case 101
106 Servo On
107 Wait M_Svo=1
108 Tool P_NTool
109  '作业１
110 Hlt                       '手编移动机器人到像素中心
111 P0=P_Fbc
112 P91=P0*(+0.000,+0.000,+0.000,+0.000,+0.000,+90.000)
113 Mvs P91                                                         '旋转90度
114 Hlt                       '手编再次移动机器人到像素中心
115 '作业２ 直角坐标下移动X,Y轴到十字标定点
116 P90=P_Fbc
117 PTL=P_Zero
118 PT=Inv(P90)*P0
119 PTL.X=(PT.X+PT.Y)/2
120 PTL.Y=(-PT.X+PT.Y)/2
121 P_02=PTL
122 Tool P_02
123 Break
124 End Select
125 M_01#=0
126 M_02#=0
127 M_05#=0
128 Return 0
129 '====================================================================
130 '自动模式   'M_02=200~299
131 *LAUTO:
132 MFEATURES = M_02#
133 Select MFEATURES
134 M_01#=0
135 '==================================
136 '自动开
137 Case 200         ''自动ON
138 *LAuto1
139 If M_02#=201 Then*lEndAuto
140 Mvs p10
141 Mvs p11
142 GoTo *LAuto1
143 *lEndAuto
144 Break
145 '==================================
146 '自动关
147 Case 201         ''自动OFF
148 Dly 0.1
149 Break
150 End Select
151 M_01#=0
152 M_02#=0
153 Return 0
154 '====================================================================
155 '手动模式
156 *LMANUAL:
157 M_01#=0
158 MFEATURES = M_02#
159 Select MFEATURES
160 '==================================
161 'X+
162 Case 300
163 Spd M_03#
164 P20=P_Fbc
165 P20.X=P20.X+M_04#
166 Mvs P20
167 Break
168 '==================================
169 ''X-
170 Case 301
171 Spd M_03#
172 P20=P_Fbc
173 P20.X=P20.X-M_04#
174 Mvs P20
175 Break
176 '==================================
177 ''Y+
178 Case 302
179 Spd M_03#
180 P20=P_Fbc
181 P20.Y=P20.Y+M_04#
182 Mvs P20
183 Break
184 '==================================
185 ''Y-
186 Case 303
187 Spd M_03#
188 P20=P_Fbc
189 P20.Y=P20.Y-M_04#
190 Mvs P20
191 Break
192 '==================================
193 'Z+
194 Case 304
195 Spd M_03#
196 P20=P_Fbc
197 P20.Z=P20.Z+M_04#
198 Mvs P20
199 Break
200 '==================================
201 'Z-
202 Case 305
203 Spd M_03#
204 P20=P_Fbc
205 P20.Z=P20.Z-M_04#
206 Mvs P20
207 Break
208 '==================================
209 ''拍照位
210 Case 306
211 Spd M_03#
212 P20=P_Fbc
213 P20.Z=90
214 Mvs P20
215 Mvs Psafety                'Psafety 安全位
216 Mvs PVSCHK,20
217 Mvs PVSCHK               'PVSCHK拍照位
218 Break
219 '==================================
220 ''取料位
221 Case 307
222 Spd M_03#
223 P20=P_Fbc
224 P20.Z=90
225 Mvs P20
226 Mvs Psafety                'Psafety 安全位
227 Mvs pick,20
228 Mvs pick                    'pick 取料位
229 Break
230 '==================================
231 ''放料位
232 Case 308
233 Spd M_03#
234 P20=P_Fbc
235 P20.Z=90
236 Mvs P20
237 Mvs Psafety                'Psafety 安全位
238 Mvs put,20
239 Mvs put                      'put放料位
240 Break
241 Case 309
242 Servo Off
243 Break
244 End Select
245 Return 0
246 '====================================================================
247 '视觉坐标标定模式
248 *LVISUAL:
249 MFEATURES = M_02#
250 Select MFEATURES
251 ''==================================
252 ''上CCD
253 Case 400
254 ''像素标定
255 ''相机像素点转换为机器人坐标 走N个点  记录机器人位置   与像素点对应写入标定
256 ''将一个点移动至视野中心     在视野范围内移动N个点  记录机器人当前位置 和像素点
257 *L100:
258 Tool P_01
259 Servo On
260 Wait M_Svo=1
261 Spd 100
262 P5=P_Fbc                                                             '十字中心点与视野中心点重合                                                                                                      '保存中心点P1的机器人坐标
263 P1=P5*(-10.000,-10.000,+0.000,+0.000,+0.000,+0.000)
264 P2=P5*(+0.000,-10.000,+0.000,+0.000,+0.000,+0.000)
265 P3=P5*(+10.000,-10.000,+0.000,+0.000,+0.000,+0.000)
266 P4=P5*(-10.000,+0.000,+0.000,+0.000,+0.000,+0.000)
267 P6=P5*(+10.000,+0.000,+0.000,+0.000,+0.000,+0.000)
268 P7=P5*(-10.000,+10.000,+0.000,+0.000,+0.000,+0.000)
269 P8=P5*(+0.000,+10.000,+0.000,+0.000,+0.000,+0.000)
270 P9=P5*(+10.000,+10.000,+0.000,+0.000,+0.000,+0.000)
271 Mvs P1
272 Close
273 Open "COM3:" As #1
274 Dly 0.2
275 Print #1,"TRGS"
276 Input #1,M4,m5
277 M1=P1.X
278 M2=P1.Y
279 M3=0
280 Print #1,"XY",M1,M2
281 Input #1,M3
282 Wait M3=1                                                                                          '读取机器人1号位置坐标，CCD像素坐标
283 Mvs P2
284 Dly 0.2
285 Print #1,"TRGS"
286 Input #1,M4,m5
287 M1=P2.X
288 M2=P2.Y
289 Print #1,"XY",M1,M2
290 Input #1,M3
291 Wait M3=1
292 Mvs P3
293 Dly 0.2
294 Print #1,"TRGS"
295 Input #1,M4,m5
296 M1=P3.X
297 M2=P3.Y
298 Print #1,"XY",M1,M2
299 Input #1,M3
300 Wait M3=1
301 Mvs P4
302 Dly 0.2
303 Print #1,"TRGS"
304 Input #1,M4,m5
305 M1=P4.X
306 M2=P4.Y
307 Print #1,"XY",M1,M2
308 Input #1,M3
309 Wait M3=1
310 Mvs P5
311 Dly 0.2
312 Print #1,"TRGS"
313 Input #1,M4,m5
314 M1=P5.X
315 M2=P5.Y
316 Print #1,"XY",M1,M2
317 Input #1,M3
318 Wait M3=1
319 Mvs P6
320 Dly 0.2
321 Print #1,"TRGS"
322 Input #1,M4,m5
323 M1=P6.X
324 M2=P6.Y
325 Print #1,"XY",M1,M2
326 Input #1,M3
327 Wait M3=1
328 Mvs P7
329 Dly 0.2
330 Print #1,"TRGS"
331 Input #1,M4,m5
332 M1=P7.X
333 M2=P7.Y
334 Print #1,"XY",M1,M2
335 Input #1,M3
336 Wait M3=1
337 Mvs P8
338 Dly 0.2
339 Print #1,"TRGS"
340 Input #1,M4,m5
341 M1=P8.X
342 M2=P8.Y
343 Print #1,"XY",M1,M2
344 Input #1,M3
345 Wait M3=1
346 Close
347 Mvs P9
348 Print #1,"TRGS"
349 Input #1,M4,m5
350 M1=P9.X
351 M2=P9.Y
352 Print #1,M1,M2
353 Input #1,M3
354 Wait M3=1
355 Close
356 Break
357 ''==================================
358 ''下CCD
359 Case 401
360 Tool P_02
361 Servo On
362 Wait M_Svo=1
363 Spd 100
364 P5=P_Fbc                                                   '十字中心点与视野中心点重合                                                                                                      '保存中心点P1的机器人坐标
365 P1=P5*(-10.000,-10.000,+0.000,+0.000,+0.000,+0.000)
366 P2=P5*(+0.000,-10.000,+0.000,+0.000,+0.000,+0.000)
367 P3=P5*(+10.000,-10.000,+0.000,+0.000,+0.000,+0.000)
368 P4=P5*(-10.000,+0.000,+0.000,+0.000,+0.000,+0.000)
369 P6=P5*(+10.000,+0.000,+0.000,+0.000,+0.000,+0.000)
370 P7=P5*(-10.000,+10.000,+0.000,+0.000,+0.000,+0.000)
371 P8=P5*(+0.000,+10.000,+0.000,+0.000,+0.000,+0.000)
372 P9=P5*(+10.000,+10.000,+0.000,+0.000,+0.000,+0.000)
373 Mvs P1
374 Close
375 Open "COM3:" As #1
376 Dly 0.2
377 Print #1,"TRGS"
378 Input #1,M4,m5
379 M1=P1.X
380 M2=P1.Y
381 M3=0
382 Print #1,"XY",M1,M2
383 Input #1,M3
384 Wait M3=1                                                                                          '读取机器人1号位置坐标，CCD像素坐标
385 Mvs P2
386 Dly 0.2
387 Print #1,"TRGS"
388 Input #1,M4,m5
389 M1=P2.X
390 M2=P2.Y
391 Print #1,"XY",M1,M2
392 Input #1,M3
393 Wait M3=1
394 Mvs P3
395 Dly 0.2
396 Print #1,"TRGS"
397 Input #1,M4,m5
398 M1=P3.X
399 M2=P3.Y
400 Print #1,"XY",M1,M2
401 Input #1,M3
402 Wait M3=1
403 Mvs P4
404 Dly 0.2
405 Print #1,"TRGS"
406 Input #1,M4,m5
407 M1=P4.X
408 M2=P4.Y
409 Print #1,"XY",M1,M2
410 Input #1,M3
411 Wait M3=1
412 Mvs P5
413 Dly 0.2
414 Print #1,"TRGS"
415 Input #1,M4,m5
416 M1=P5.X
417 M2=P5.Y
418 Print #1,"XY",M1,M2
419 Input #1,M3
420 Wait M3=1
421 Mvs P6
422 Dly 0.2
423 Print #1,"TRGS"
424 Input #1,M4,m5
425 M1=P6.X
426 M2=P6.Y
427 Print #1,"XY",M1,M2
428 Input #1,M3
429 Wait M3=1
430 Mvs P7
431 Dly 0.2
432 Print #1,"TRGS"
433 Input #1,M4,m5
434 M1=P7.X
435 M2=P7.Y
436 Print #1,"XY",M1,M2
437 Input #1,M3
438 Wait M3=1
439 Mvs P8
440 Dly 0.2
441 Print #1,"TRGS"
442 Input #1,M4,m5
443 M1=P8.X
444 M2=P8.Y
445 Print #1,"XY",M1,M2
446 Input #1,M3
447 Wait M3=1
448 Close
449 Mvs P9
450 Print #1,"TRGS"
451 Input #1,M4,m5
452 M1=P9.X
453 M2=P9.Y
454 Print #1,M1,M2
455 Input #1,M3
456 Wait M3=1
457 Close
458 Break
459 End Select
460 Return 0
461 '====================================================================
462 '====================================================================
463 '====================================================================
464 ''速度设置
465 '*LSPEED:
466 'M_05#=1
467 'MSPD=M_03#
468 'M_02#=0
469 'M_01#=0
470 'M_05#=0
471 Return 0
P0=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P91=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P90=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
PTL=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
PT=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
p10=(+370.064,-151.063,+76.272,+0.000,+0.000,+79.934)(0,0)
p11=(+370.064,-151.063,+66.272,+0.000,+0.000,+79.934)(0,0)
P20=(+296.562,-195.039,+90.000,+0.000,+0.000,+79.918)(0,0)
Psafety=(+400.000,-150.000,+90.000,+0.000,+0.000,+79.918)(0,0)
PVSCHK=(+296.562,-195.039,+70.000,+0.000,+0.000,+79.918)(0,0)
pick=(+103.650,-195.039,+70.000,+0.000,+0.000,+79.918)(0,0)
put=(+140.522,-201.131,+70.000,+0.000,+0.000,+79.918)(0,0)
P5=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P1=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P2=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P3=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P4=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P6=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P7=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P8=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P9=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
