1 'PICK 上料位
2 'PVSCHK 拍照位
3 'PUT 放料位
4 PICK = P_03
5 PVSCHK = P_04
6 PUT = P_05
7 '==================================
8 '下CDD
9 Tool P_NTool            '将控制点返回到初始值。(机械I/F位置、法兰面 )
10 Close                        '关闭全部文件
11 Loadset 1, 1               '设置，抓手1，工件1
12 OAdl On                   '打开最佳加减速控制
13 Spd 100                    '速度指定100。单位：［mm/s］
14 Servo On                  '伺服使能
15 Wait M_Svo = 1           '待机直到伺服使能
16 M_Out(16) = 0            '将输出点16置位0
17 P1 = P_Fbc                 '将现在位置赋值给P1。
18 P1.Z = 90                   '将P1的Z轴高度设为90。
19 Mvs P1
20 Mov PICK, 50              '上料位PICK
21 Mvs PICK
22 Dly 0.2
23 M_Out(16) = 1
24 Dly 0.5
25 Mvs PICK, 50
26 Dly 0.2
27 Mov PVSCHK              '拍照位PVSCHK
28 Hlt
29 Dly 0.2
30 Open "COM3:" As #1           '打开通讯端口COM3、文件2
31 Wait M_Open(1) = 1            '等待COM2打开才执行下一步
32 Print #1, "TRGS"                 '发送TRG，让相机拍照
33 Dly 0.1
34 Input #1, mx1, my1, mc1        '接收来至相机的数据mx,my,ma
35 mx1 = mx1/1000
36 my1 = my1/1000
37 mc1 = mc1/1000
38 pvs1 = P_Zero                      '将pvs0返回到(0,0,0,0,0,0,0,0)(0,0)。
39 pvs1 = PVSCal(2, mx1, my1, mc1)  '将视觉传感器输出的像素数据转换成机器人的坐标数据
40 pvs1.C = Rad(mc1)                 '将ma角度单位度(deg)转换为弧度(rad)。写进pvs0.C
41 pvs1.FL1 = PVSCHK.FL1             '将pvschk.FL1 赋值给pvs0.FL1
42 pvs1.FL2 = PVSCHK.FL2             '将pvschk.FL2 赋值给pvs0.FL2
43 ph1 = Inv(pvs1)*PVSCHK          '计算从视觉传感器输出位置到抓取位置的修正值PH
44 '==================================
45 '上 CDD
46 Open "COM4:" As #2             '打开通讯端口COM1、文件1
47 Wait M_Open(2) = 1              '等待COM1打开才执行下一步
48 Print# 2, "TRGS"                   '发送TRG，让相机拍照
49 Dly 0.1
50 Input #1, mx2, my2, mc2       '接收来至相机的数据mx,my,ma
51 pvs2 = P_Zero                       '将pvs0返回到(0,0,0,0,0,0,0,0)(0,0)。
52 pvs2 = PVSCal(1, mx2, my2, mc2)  '将视觉传感器输出的像素数据转换成机器人的坐标数据
53 pvs2.C = Rad(mc2)                  '将ma角度单位度(deg)转换为弧度(rad)。写进pvs0.C
54 pvs2.FL1 = PUT.FL1            '将pvschk.FL1 赋值给pvs0.FL1
55 pvs2.FL2 = PUT.FL2            '将pvschk.FL2 赋值给pvs0.FL2
56 ph2 = Inv(pvs2) * PUT        '计算从视觉传感器输出位置到抓取位置的修正值PH
57 P_01=ph1                           '将ph1赋值给全局变量P_01
58 P_02=ph2                           '将ph2赋值给全局变量P_02
59 Hlt
PICK=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
PVSCHK=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
PUT=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
P1=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
pvs1=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
ph1=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
pvs2=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
ph2=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
PCU=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
ph=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
Phome=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
PHUP=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
ppick=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
pplace=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
pvs=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
pvs0=(+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000,+0.000)(,)
